OpenNuvoton/M480BSP/SampleCode/StdDriver/HSUSBH_USBH_SPIM_Writer/main.c
/*
 *  d <addr> <len>
 */
int  dump_spim_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    uint32_t    faddr, addr;                /* flash address                              */
    uint32_t    dump_len;                   /* dump length                                */
    UINT        len;                        /* data length                                */

    if (!xatoi(&ptr, &faddr)) {             /* get <addr> parameter (SPIM flash address)  */
        printf("Usage:  d <addr> <len>\n");
        return -1;
    }
    faddr = faddr - (faddr % BUFF_SIZE);    /* force block alignment                      */

    if (!xatoi(&ptr, &dump_len)) {          /* get <len> parameter (data dump length)     */
        printf("Usage:  d <addr> <len>\n");
        return -1;
    }

    SPIM_ReadJedecId(idBuf, sizeof (idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    SPIM_Enable_4Bytes_Mode(IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    /*
     *  Read and dump ...
     */
    for (addr = faddr; dump_len > 0; addr += BUFF_SIZE) {
        memset(Buff1, 0, BUFF_SIZE);        /* fill 0x00 to clear buffer                  */
        /* DMA read SPIM flash                        */
        SPIM_DMA_Read(addr, IS_4BYTES_ADDR, BUFF_SIZE, Buff1, CMD_DMA_FAST_READ, 1);

        if (dump_len < BUFF_SIZE)
            len = dump_len;
        else
            len = BUFF_SIZE;

        dump_buff_hex(addr, Buff1, len);    /* dump data                                  */
        dump_len -= len;
    }
    return 0;
}

/*
 *  g <addr>
 *
 *  Example:
 *  Assumed the image located on SPIM flash offset address 0x2000. It's RO_BASE must
 *  be (SPIM_DMM_MAP_ADDR+0x2000). To branch and run this image, user must issue
 *  command "g 0x2000".
 */
int  go_to_flash(char *cmdline)
{
    char        *ptr = cmdline;             /* command string pointer                     */
    uint32_t    faddr;                      /* flash address                              */
    FUNC_PTR    *func;                      /* function pointer                           */

    if (!xatoi(&ptr, &faddr)) {             /* get <addr> parameter (SPIM flash address)  */
        printf("Usage:  g <addr>\n");
        return -1;
    }

    SPIM_ReadJedecId(idBuf, sizeof (idBuf), 1);
    printf("Flash ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    SPIM_DISABLE_CCM();
    SPIM_ENABLE_CACHE();

    SPIM_Enable_4Bytes_Mode(IS_4BYTES_ADDR, 1);  /* Enable 4-bytes address mode?          */

    SPIM->CTL1 |= SPIM_CTL1_CDINVAL_Msk;    /* invalid cache                              */
    /* Enable DMM mode                            */
    SPIM_EnterDirectMapMode(IS_4BYTES_ADDR, CMD_DMA_FAST_READ, 0);

    func = (FUNC_PTR *)inpw(SPIM_DMM_MAP_ADDR + faddr + 4);

    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;   /* disable SYSTICK (prevent interrupt)   */

    __set_SP(inpw(SPIM_DMM_MAP_ADDR + faddr));

    func();                                      /* branch to SPIM                        */

    return 0;
}

/*----------------------------------------------------------------------------------------*/
/*  MAIN function                                                                         */
/*----------------------------------------------------------------------------------------*/
int32_t main(void)
{
    char        *ptr;                       /* str pointer                                */

    SYS_Init();                             /* Init System, clock and I/O pins.           */

    UART0_Init();                           /* Initialize UART0                           */

    enable_sys_tick(100);

    printf("\n\n");
    printf("+-----------------------------------------------+\n");
    printf("|   USB SPIM writer                             |\n");
    printf("+-----------------------------------------------+\n");

    SYS_UnlockReg();                        /* Unlock register lock protect               */

    SPIM_SET_CLOCK_DIVIDER(2);             /* Set SPIM clock as HCLK divided by 4        */

    SPIM_SET_RXCLKDLY_RDDLYSEL(0);         /* Insert 0 delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    SPIM_SET_RXCLKDLY_RDEDGE();            /* Use SPI input clock rising edge to sample received data. */

    SPIM_SET_DCNUM(8);                     /* 8 is the default value.                    */

    if (SPIM_InitFlash(1) != 0) {           /* Initialized SPI flash                      */
        printf("SPIM flash initialize failed!\n");
        while (1);
    }

    SPIM_ReadJedecId(idBuf, sizeof (idBuf), 1);   /* read SPIM flash ID                   */
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    usbh_core_init();                       /* initialize USB Host library                */
    usbh_umas_init();                       /* initialize USB mass storage driver         */
    usbh_pooling_hubs();                    /* monitor USB hub ports                      */

    f_chdrive(usbh_path);                   /* set default path                           */

    for (;;) {
        usbh_pooling_hubs();

        printf(_T(">"));
        ptr = Line;

        get_line(ptr, sizeof(Line));

        switch (*ptr++) {

        case 'h':
        case '?':                           /* Show usage                                 */
            printf(
                _T("l - List root directory files\n")
                _T("w <file> <addr> - Write a file to SPIM flash. <addr> is an offset from SPIM flash base.\n")
                _T("c <file> <addr> - Compare a file with SPIM flash. <addr> is an offset from SPIM flash base.\n")
                _T("d <addr> <len> - Dump SPIM offset <addr> contents.\n")
                _T("g <addr> - Branch to SPIM offset <addr> and execute.\n")
            );
            break;

        case 'l' :                          /* List root directory files                  */
            show_root_dir();
            break;

        case 'w' :                          /* w <file> <addr>                            */
            write_file_to_flash(ptr);       /* Write a file to SPIM flash.                */
            break;

        case 'c' :                          /* c <file> <addr>                            */
            compare_file_with_flash(ptr);   /* Compare a file with SPIM flash block.      */
            break;

        case 'd' :                          /* d <addr> <len>                             */
            dump_spim_flash(ptr);           /* Dump contents of a SPIM flash block.       */
            break;

        case 'g' :                          /* g <addr>                                   */
            go_to_flash(ptr);               /* Branch to SPIM flash offset <addr>         */
            break;
        }
    }
}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/

